---
title: "Alter table"
date: 2019-03-29T19:14:46+05:30
draft: False
author: "Nitin Patil"

---

The ALTER TABLE statement is used to add, delete, or modify columns in an existing table.
It is also used to add and drop various constraints on an existing table.

## Setup

In [1]:
import sqlalchemy as db
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

engine = db.create_engine('mysql+pymysql://root:root@localhost:3306/test')

def ex(query):
    result = engine.execute(query)
    return result.fetchall() if result.returns_rows else None

def de(query):
    data = engine.execute(query).fetchall()
    cols = [x[0] for x in engine.execute(query).cursor.description]
    return pd.DataFrame(data=data, columns=cols)

## Current state

In [ ]:
ex("DROP TABLE IF EXISTS student;")

In [3]:
ex("""CREATE TABLE student(
student_id INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
first_name VARCHAR(30) NOT NULL,
last_name VARCHAR(30) NOT NULL
);""")

In [4]:
ex("SHOW TABLES")

[('student',)]

In [5]:
de("DESCRIBE student")

        Field              Type Null  Key Default           Extra
0  student_id  int(10) unsigned   NO  PRI    None  auto_increment
1  first_name       varchar(30)   NO         None
2   last_name       varchar(30)   NO         None

## Alter tables

### Add column

In [ ]:
-- ALTER TABLE table_name
-- ADD col_name datatype null_or_not AFTER which_col

In [6]:
ex("""ALTER TABLE student
ADD birth_date DATE NOT NULL;
""")

In [7]:
de("DESCRIBE student")

        Field              Type Null  Key Default           Extra
0  student_id  int(10) unsigned   NO  PRI    None  auto_increment
1  first_name       varchar(30)   NO         None
2   last_name       varchar(30)   NO         None
3  birth_date              date   NO         None

In [8]:
ex("""ALTER TABLE student
ADD email VARCHAR(60) NULL AFTER last_name;
""")

de("DESCRIBE student")

        Field              Type Null  Key Default           Extra
0  student_id  int(10) unsigned   NO  PRI    None  auto_increment
1  first_name       varchar(30)   NO         None
2   last_name       varchar(30)   NO         None
3       email       varchar(60)  YES         None
4  birth_date              date   NO         None

### Drop column

In [9]:
-- ALTER TABLE table_name
-- DROP COLUMN column_name;

ex("""ALTER TABLE student
DROP COLUMN email;
""")

de("DESCRIBE student")

        Field              Type Null  Key Default           Extra
0  student_id  int(10) unsigned   NO  PRI    None  auto_increment
1  first_name       varchar(30)   NO         None
2   last_name       varchar(30)   NO         None
3  birth_date              date   NO         None

### Modify column datatype

In [10]:
-- ALTER TABLE table_name
-- MODIFY COLUMN column_name datatype;

ex("""ALTER TABLE student
MODIFY COLUMN birth_date YEAR ;
""")

de("DESCRIBE student")

        Field              Type Null  Key Default           Extra
0  student_id  int(10) unsigned   NO  PRI    None  auto_increment
1  first_name       varchar(30)   NO         None
2   last_name       varchar(30)   NO         None
3  birth_date           year(4)  YES         None

### Change column name

In [14]:
-- ALTER TABLE table_name
-- CHANGE current_name new_col_name datatype;

ex("""ALTER TABLE student
CHANGE birth_date birth_year YEAR NOT NULL;
""")

de("DESCRIBE student")

        Field              Type Null  Key Default           Extra
0  student_id  int(10) unsigned   NO  PRI    None  auto_increment
1  first_name       varchar(30)   NO         None
2   last_name       varchar(30)   NO         None
3  birth_year           year(4)   NO         None

### References
- https://www.w3schools.com/sql/sql_alter.asp